ch5/ch5-3.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-10-22 Thu 10:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chapter 5.3</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="pedh" />
<link rel="stylesheet" type="text/css" href="/css/org-info.css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/CLRS-Solutions"> UP </a>
 |
 <a accesskey="H" href="/CLRS-Solutions"> HOME </a>
</div><div id="content">
<h1 class="title">Chapter 5.3</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgea2989c">ch5.3</a>
<ul>
<li><a href="#org44ccf0b">5.3-1</a></li>
<li><a href="#orgf3fbd51">5.3-2</a></li>
<li><a href="#org8823001">5.3-3</a></li>
<li><a href="#org7e560b0">5.3-4</a></li>
<li><a href="#orge3fe944">5.3-5</a></li>
<li><a href="#org462ab74">5.3-6</a></li>
<li><a href="#orgeaaa694">5.3-7</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgea2989c" class="outline-2">
<h2 id="orgea2989c">ch5.3</h2>
<div class="outline-text-2" id="text-orgea2989c">
</div>
<div id="outline-container-org44ccf0b" class="outline-3">
<h3 id="org44ccf0b">5.3-1</h3>
<div class="outline-text-3" id="text-org44ccf0b">
<pre class="example">
RANDOMIZE-IN-PLACE(A)
    n = A.length
    swap A[1] with A[RANDOM(1, n)]
    for i = 2 to n
	swap A[i] with A[RANDOM(2, n)]
</pre>
<p>
Modify the initialization case by replace \(i = 1\) to \(i = 2\).
</p>
</div>
</div>
<div id="outline-container-orgf3fbd51" class="outline-3">
<h3 id="orgf3fbd51">5.3-2</h3>
<div class="outline-text-3" id="text-orgf3fbd51">
<p>
No, because the procedure can't generate the premutations that keep any
element identical, e.g., \(\langle A[3], A[2], A[1], \ldots\rangle\).
</p>
</div>
</div>
<div id="outline-container-org8823001" class="outline-3">
<h3 id="org8823001">5.3-3</h3>
<div class="outline-text-3" id="text-org8823001">
<p>
No, because the algorithm will generate \(n^n\) permutations
in the same probability, and \(n^n\) does not divide by \(n!\),
thus the \(n!\) permutations can not have the same probability.
</p>
</div>
</div>
<div id="outline-container-org7e560b0" class="outline-3">
<h3 id="org7e560b0">5.3-4</h3>
<div class="outline-text-3" id="text-org7e560b0">
<p>
Each offset in RANDOM(1, n) transpose A[i] to distinct position in B, i.e.,
each element A[i] has a 1/n probability of winding up in any particular
position in B.
</p>

<p>
The algorithm can only generate n permutations, so the resulting permutation
is not uniformly random.
</p>
</div>
</div>
<div id="outline-container-orge3fe944" class="outline-3">
<h3 id="orge3fe944">5.3-5</h3>
<div class="outline-text-3" id="text-orge3fe944">
<p>
The probability that all elements are unique is
</p>
\begin{align*}
\Pr\{\text{all unique}\}
&=\frac{P(n^3,n)}{(n^3)^n}\\
&>\frac{(n^3-n)^n}{(n^3)^n}\\
&=(1-\frac{1}{n^2})^n\\
&> 1-\frac{1}{n} &\text{, algebra inequality}
\end{align*}
</div>
</div>
<div id="outline-container-org462ab74" class="outline-3">
<h3 id="org462ab74">5.3-6</h3>
<div class="outline-text-3" id="text-org462ab74">
<p>
Sort the elements with same priority in random order.
</p>
</div>
</div>
<div id="outline-container-orgeaaa694" class="outline-3">
<h3 id="orgeaaa694">5.3-7</h3>
<div class="outline-text-3" id="text-orgeaaa694">
<p>
We use math induction to prove the correctness of the algorithm.
</p>

<p>
<b>Loop invariant:</b> The procedure returns a random m-subset S of
\(\{1,2,3,\ldots,n\}\) in which m-subset is equally likely, i.e.,
\((\forall x \in \{1,2,3,\ldots,n\}) [\Pr\{x \in S\} = \frac{m}{n}]\).
</p>

<p>
<b>Initialization:</b> The procedure returns \(\emptyset\) when \(m = 0\).
</p>

<p>
<b>Maintenance:</b> We assumes that the procedure holds the loop invariant
of (m-1)-subset S' of \(\{1,2,3,\ldots,n-1\}\), then for m-subset S of
\(\{1,2,3,\ldots,n\}\), we have
</p>
\begin{align*}
\Pr\{n\in S'\}
&=\Pr\{x=n\}+\Pr\{x\in S'\}\\
&=\frac{1}{n}+\frac{m-1}{n}\\
&=\frac{m}{n}
\end{align*}
\begin{align*}
(\forall k\in \{1,2,3,\ldots,n-1\})\Pr\{k\in S'\}
&=\Pr\{k\in S'\}+\Pr\{k\notin S'\}\times\Pr\{x=k\}\\
&=\frac{m-1}{n-1}+(1-\frac{m-1}{n-1})\frac{1}{n}\\
&=\frac{m}{n}
\end{align*}
<p>
thus \((\forall x \in \{1,2,3,\ldots,n\}) [\Pr\{x \in S\} = \frac{m}{n}]\).
</p>

<p>
<b>Termination:</b> At termination, the procedure returns m-subset of
\(\{1,2,3,\ldots,n\}\) as expected.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: pedh</p>
<p class="date">Created: 2020-10-22 Thu 10:05</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
